<template>
    <div class="telContainer">
        <TopNav></TopNav>
        <div class="agreeContent">
            <p class="title">一、特别声明 </p>
            <p class="text">1.1大连金乐烟花有限公司同意按照本协议的规定及其不时发布的操作规则提供基于移动网络的烟花网手机应用软件服务（以下称烟花网），为获得服务，烟花网使用人（以下称用户）应当基于了解本协议全部内容，在独立思考的基础上认可、同意本协议的全部条款并按照页面上的提示完成全部的注册程序。用户在进行注册程序过程中点击\同意\ 按钮即表示用户完全接受本协议。如果您不同意本协议的任意内容，或者无法准确理解本公司对条款的解释，请不要进行后续操作，包括但不限于不要接受本协议，不使用本服务。</p>
            <p class="text">1.2为提高用户的使用感受和满意度，用户同意烟花网将基于用户的操作行为对用户数据进行调查研究和分析，从而进一步优化烟花网的服务。</p>
            <p class="title">二、服务内容</p>
            <p class="text"> 2.1烟花网的具体服务由大连金乐烟花有限公司根据实际情况提供，例如在线课堂、采购信息服务等。烟花网保留变更、中断或终止部分或全部服务的权利。 </p>
            <p class="text">2.2烟花网的部分服务为收费服务，用户使用收费服务需要向烟花网支付一定的费用。对于收费服务，烟花网会在用户使用之前给予用户明确的提示，只有用户根据提示确认其愿意支付相关费用，用户才能使用该等收费服务。如用户拒绝支付相关费用，则烟花网有权不向用户提供该等收费服务。</p>
            <p class="text">2.3用户理解，烟花网仅提供交易服务相关的技术服务等，除此之外与相关服务有关的设备（如手机及其他与接移动网有关的装置）及所需的费用（如为使用移动网而支付的手机费）均应由用户自行负担。</p>
            <p class="title">三、使用规则 </p>
            <p class="text">3.1用户使用手机号为账户注册烟花网，该帐号和密码由用户负责保管；用户应当对以其用户帐号进行的所有活动和事件负法律责任。若因为用户自身原因，而导致帐号、密码遭他人非法使用时，烟花网概不负责。</p>
            <p class="text">3.2 用户进行实名认证和获取终端码时，应提供真实有效的证件，如证件被查明作假，烟花网有权冻结用户通过烟花网获得的收益，封止和删除帐号。 </p>
            <p class="text">3.3用户在使用烟花网过程中，必须遵循以下原则：</p>
            <p class="text">•遵守中国有关的法律和法规；</p>
            <p class="text">•不得为任何非法目的而使用烟花网；</p>
            <p class="text">•如发现任何非法使用用户帐号或帐号出现安全漏洞的情况，应立即通告烟花网。</p>
            <p class="text">3.4烟花网目前支持Android系统的手机，Android版本兼容各大主流厂商的手机型号和8.0以上系统，对低版本系统或个别机型产生的不兼容问题，烟花网会尽力配合用户解决问题，但不承担任何法律责任，用户无权对烟花网追究其法律责任。</p>
            <p class="title">四、知识产权 </p>
            <p class="text">4.1烟花网提供的服务内容可能包括：文字、声音、图片、图表等。所有这些内容均为大连金乐烟花有限公司或授权大连金乐烟花有限公司使用的合法权利人所有，除非事先经大连金乐烟花有限公司或其权利人的合法授权，任何人皆不得擅自以任何形式使用，否则烟花网可立即终止向用户提供产品和服务，并依法追究其法律责任，赔偿烟花网一切损失。</p>
            <p class="text">五、隐私保护</p>
            <p class="text">5.1本站不对外公开或向第三方提供单个用户的注册资料及用户在使用网络服务时存储在本站的非公开内容，但下列情况除外： </p>
            <p class="text">(1)事先获得用户的明确授权；</p>
            <p class="text">(2)根据有关的法律法规要求；</p>
            <p class="text">(3)按照相关政府主管部门的要求；</p>
            <p class="text">(4)为维护社会公众的利益。</p>
            <p class="text">(5)为维护烟花网的合法权益。</p>
            <p class="text">5.2在不透露单个用户隐私资料的前提下，烟花网有权对整个用户数据库进行分析并对用户数据库进行商业上的利用（包括但不限于公布、分析或以其它方式使用用户访问量、访问时段、用户偏好等用户数据信息）。</p>
             <p class="text">六、免责声明</p>
            <p class="text">6.1为了烟花网的正常运行，需要定期或不定期地对烟花网进行维护，因此类情况而造成的正常服务中断、停止，用户应该予以理解</p>
            <p class="text">6.2如果烟花网发现用户有下列任一行为的，有权根据相应网络服务的公约或守则的规定，采取相应措施：包括但不限于对该用户帐号的冻结、终止、删除；用户在此承诺烟花网有权作出上述行为，并承诺不就上述行为要求烟花网做任何补偿或退费：</p>
            <p class="text">(1)用户提供虚假注册信息；</p>
            <p class="text">(2)用户违反本协议中规定的使用规则；</p>
            <p class="text">(3)通过非法手段、不正当手段或其他不公平的手段使用烟花网的服务或参与烟花网活动；</p>
            <p class="text">(4)有损害烟花网正当利益的行为；</p>
            <p class="text">(5)有严重损害其他用户的行为；</p>
            <p class="text">(6)有违反中华人民共和国的法律、法规的行为或言论；</p>
            <p class="text">(7)有违背社会风俗、社会道德和互联网一般道德和礼仪的行为；</p>
            <p class="text">(8)其他妨碍烟花网提供服务或烟花网认为的严重不当行为；</p>
            <p class="text">同一用户若有任一帐号存在上述任一行为的，烟花网有权对该用户下的所有帐号予以制裁，包括但不限于冻结帐号、删除帐号、终止服务等。</p>
            <p class="text">烟花网因上述原因删除用户注册的帐号后即不再对用户承担任何义务和责任。</p>
            <p class="text"> 6.3用户同意保障和维护烟花网及其他用户的利益，如因用户违反有关法律、法规或本协议项下的任何条款而给烟花网或任何其他第三人造成损失，用户同意承担由此造成的损害赔偿责任。</p>
            <p class="title">七、修改协议 </p>
            <p class="text">7.1 根据实际需求，烟花网将可能不时的修改本协议的有关条款，一旦条款内容发生变动，烟花网将会在相关的页面提示修改内容。</p>
            <p class="text">7.2 如果用户不同意烟花网修改的内容，用户可以主动取消获得的网络服务。如果用户在修改内容公告后7天内未主动取消服务，则视为接受条款的变更；修改内容公告后用户如果仍继续使用烟花网提供的服务亦构成对条款变更的接受。</p>
            <p class="text">八、法律管辖</p>
            <p class="text">8.1 本协议的订立、执行和解释及争议的解决均应适用中国法律。</p>
            <p class="text">8.2 如双方就本协议内容或其执行发生任何争议，双方应尽量友好协商解决；协商不成时，用户和烟花网一致同意交由大连金乐烟花有限公司所在地有管辖权的法院管辖。</p>
            <p class="title" style="text-align:center">《采购功能补充协议》</p>    
            <p class="title">为促进商品流通发展，降低采购成本,经友好协商，现就用户委托烟花网提供其交易平台商品采购服务，并对网上交易行为进行管理，达成本协议：</p>           
            <p class="text">第一条、商品的订购、验收与确认</p>
            <p class="text">1、用户自愿接受本协议和网站相关规定，并按烟花网规定申请，经烟花网审核成为烟花网采购会员后，方可委托烟花网上述事项。</p>
            <p class="text">2、用户订购商品必须在线交易，烟花网对于用户任何线下交易与线下协议不承担任何责任。</p>
            <p class="text">3、本协议用户订购商品的数量与价格以实际生成的订单为准，生成订单之前用户加入购物车的商品的数量与价格可能随时变化，因此用户应尽快完成订单的确认。</p>
            <p class="text">4、用户必须用通过烟花网审核的账号进行产品的采购，订单提交、确认收货、售后问题处理等工作，使用通过审核的账号进行的操作即视为用户或企业法人授权的行为。</p>
            <p class="text">5、用户生成订单并完成付款一经执行，本协议自动生效，供应商即会将订购的商品发出，用户在货物发出后不得无理由进行退换货或拒收货物，退换货或拒收货物需经供应商或烟花网同意，否则产生的纠纷及损失由用户承担。</p>
            <p class="text">6、用户在收到商品的72小时内必须在烟花网平台确认收货，确认收货时，必须认真检查商品外包装是否破损、商品遗失，并根据物流运单认真审核商品件数，当出现意外情况时，必须当场与送货人员进行核实及确定问题原因，并在当日向供应商或烟花网反馈，明确处理意见。用户未在规定时间内确认收货又未提出异议、或未与送货人员沟通明确问题原因，所产生的纠纷及损失由用户负全责。</p>
            <p class="text">7、用户未在规定时间内系统确认又无情况反馈的，烟花网及供应商视同用户完整无误的收到货物。用户验收不认真，事后提出非质量本身原因的要求，烟花网不予以接受。</p>
            <p class="text">8、用户不得借故不正当或虚假理由，要求退货或取消订单，一经查实，用户应承担因此带来的一切费用和损失。</p>       
            <p class="text">9、非以下原因，用户不得提出拒收、或退货请求：</p>
            <p class="text">(1)未经许可出现的商品或其批号与订单不一致的；</p>
            <p class="text">(2)可以证明供应商原因造成商品内、外包装破损、污染的；</p>
            <p class="text">(3)可以证明商品存在用户因素造成的质量问题的；</p>
            <p class="text">(4)国家相关部门或用户通知禁止销售、或召回的；</p>
            <p class="title">第二条、双方权利和义务</p>
            <p class="text"> 1、用户权利与义务</p>
            <p class="text">(1)作为烟花网的会员客户，享受烟花网提供的一站式响应服务。</p>
            <p class="text">(2)用户应保证其应具备的合法资质，并提供相应证明材料，用户资料应符合国家相关法律和规定，并对其真实性负全部责任；</p>
            <p class="text">(3)遵守烟花网相关规则，认真履行采购商义务，按规定的时间、流程与协议、规则要求开展采购活动，并承担因用户原因造成的迟延交易的责任。</p>
            <p class="text">(4)不超经营范围采购商品，并按国家规范采购商品并提供相应证明文件；</p>
            <p class="text">(5)用户在系统确认收货三日内提供有效货运证明时，烟花网应协助用户索赔货物运输的损失；</p>
            <p class="text"> 2、烟花网权利与义务</p>
            <p class="text">(1)用户为烟花网的采购会员，烟花网应向其提供相应的综合性会员服务。</p>
            <p class="text">(3)如政府管理部门提出要求的，烟花网将暂停或终止提供相应服务，且不承担任何责任。</p>
            <p class="text">(3)有权对用户的订单数据及交易行为进行监督与管理，用户存在任何问题或怀疑，烟花网有权向用户发出询问或要求改正的通知，或直接终止本协议；</p>
            <p class="title">第三条、双方约定</p>
            <p class="text"> 1、用户同意使用用户联系人“手机短信”、“电子邮件”或“烟花网系统通知”形式接收烟花网通知，并认可通过上述形式与烟花网、供应商缔结或达成的相关补充协议。</p>
            <p class="text">2、用户在此承诺：用户成为采购会员时即完全同意并接受用户网站相关规则或规定。</p>
            <p class="title">第四条、违约责任</p>
            <p class="text">1、双方承诺严格遵守国家有关法律法规及履行本协议，维护双方权益。</p>
            <p class="text"> 2、因烟花网未尽到审查义务导致网站产品信息的不真实、交易产品的质量问题，导致用户利益受到损失时，烟花网承担相应的责任。</p>
            <p class="text">3、烟花网网络安全性等方面出现问题而导致用户利益受损的，烟花网将予以补救或经济损失的相应赔偿。</p>
            <p class="text"> 4、由于用户自备设备故障或用户失误造成的问题，用户自行承担责任，并赔偿供应方由此遭受的损失。</p>
            <p class="text">5、如用户不履行义务时，烟花网有权终止本合同，用户仍应承担上述违约责任。</p>
            <p class="text">6、无论本合同其他条款是否有相反约定，烟花网对用户因本合同项下行为而导致的可得利益损失、商业信誉损失以及数据丢失或损坏等其他损失不承担责任。</p>
            <p class="text">7、用户必须严格按照本协议及本网相关规则开展业务活动，认真履行职责，如因用户原因被其它客户投诉，将按照烟花网相应管理规定承担相应的处罚。</p>
            <p class="text">8、如由于战争、骚乱、恐怖主义、自然灾害、国家法律法规或规章变动、网络安全、网络无法覆盖、停电、通信线路被人为破坏，导致双方或一方不能完全或部分履行本合同义务时，受影响方不承担违约责任。在消除影响后的合理时间内，一方或双方应当继续履行合同。</p>
            <p class="text">9、如合同不能或者没有必要继续履行的，烟花网可单方面解除本合同，但应提前5日告知用户。</p>
            <p class="title">第五条、法律适用和争议解决</p>
            <p class="text">1、本合同适用中华人民共和国法律。</p>
            <p class="text">2、本合同引起的任何争议将通过双方友好协商解决，协商不成时，向签约地人民法院提起诉讼。</p>
            <p class="text">3、诉讼过程中，双方将继续履行本合同未涉诉讼的其它部分。</p>
            <p class="title">第六条、协议生效与其它</p>
            <p class="text">1、用户签署或在线接受本协议，本协议即在用户和烟花网之间产生法律效力。本协议不涉及用户与烟花网其它用户之间因网上交易而产生的法律关系及法律纠纷。</p>
            <p class="text">2、交易期间，烟花网网站已经发布的或将来发布的各类相关管理办法、规则为协议的组成部分，与协议正文具有同等法律效力。除另有约定外，烟花网相关管理办法的规定与本协议的约定不一致的，以烟花网相关管理办法、规则为准。</p>
            <p class="text">3、如果本协议的任何条款在任何时候变成不合法、无效或不可强制执行，但在根本上不影响协议的效力时，本协议的其它条款应不受影响。</p>
            <p class="text">4、本协议补充协议是本协议不可分割的组成部分，与协议正文具有同等法律效力。</p>
            <p class="text">5、协议期限为用户注册采购会员日起至资格有效期截止日或费用使用完毕之日止；</p>
            <p class="text">6、除非任何一方书面通知另一方取消服务，否则在用户资质有效和具有费用余额的情况下协议自动续约，次数不受限制。除非另有约定，否则续约期间，本协议仍有约束力。</p>
        </div>
    </div>
</template>
<script>
import TopNav from '@/components/TopNav'
export default {
    data(){
        return{
           
        }
    },
    components:{
        TopNav,
    },
    methods:{
        
    }
}
</script>
<style lang="scss" scoped>
.telContainer{
    width: 100vw;
    height: 100vh;
    background:rgba(235,235,235,1);
    .nav{
        border-bottom:2px solid #ebebeb; 
    }
    .agreeContent{
        background-color: #fff;
        margin-top: 88px;
        padding: 27px 18px 41px 27px;
        font-size:20px;
        font-family:MicrosoftYaHei;
        color:rgba(51,51,51,1);
        line-height:26px;
        letter-spacing:2px;
        .title{
            margin-bottom: 30px;
            margin-top: 27px;
        }
        .text{
            margin-bottom: 10px;
            line-height: 40px;
        }
    }
}
</style>
